In [1]:
from pandas import Series, DataFrame
import pandas as pd
import os
import numpy as np
import datetime as dt

In [2]:
df = pd.read_csv(os.getcwd()+'/vehicle_collisions.csv')

In [3]:
df.head()

,UNIQUE KEY,DATE,TIME,BOROUGH,ZIP CODE,LATITUDE,LONGITUDE,LOCATION,ON STREET NAME,CROSS STREET NAME,...,VEHICLE 1 TYPE,VEHICLE 2 TYPE,VEHICLE 3 TYPE,VEHICLE 4 TYPE,VEHICLE 5 TYPE,VEHICLE 1 FACTOR,VEHICLE 2 FACTOR,VEHICLE 3 FACTOR,VEHICLE 4 FACTOR,VEHICLE 5 FACTOR
0,3146911,1/1/15,0:20,QUEENS,11358.0,40.751847,-73.787862,"(40.7518471, -73.787862)",47 AVENUE,193 STREET,...,SPORT UTILITY/STATION WAGON,NaN,NaN,NaN,NaN,TRAFFIC CONTROL DISREGARDED,NaN,NaN,NaN,NaN
1,3146180,1/1/15,0:20,NaN,NaN,40.771289,-73.946693,"(40.7712888, -73.9466928)",NaN,NaN,...,PASSENGER VEHICLE,NaN,NaN,NaN,NaN,ANIMALS ACTION,NaN,NaN,NaN,NaN
2,3146384,1/1/15,0:21,BROOKLYN,11205.0,40.689445,-73.955121,"(40.6894449, -73.9551212)",BEDFORD AVENUE,LAFAYETTE AVENUE,...,PASSENGER VEHICLE,UNKNOWN,NaN,NaN,NaN,FATIGUED/DROWSY,UNSPECIFIED,NaN,NaN,NaN
3,3146013,1/1/15,0:30,BROOKLYN,11213.0,40.673845,-73.925080,"(40.6738445, -73.9250801)",BUFFALO AVENUE,SAINT MARKS AVENUE,...,BUS,PASSENGER VEHICLE,NaN,NaN,NaN,LOST CONSCIOUSNESS,NaN,NaN,NaN,NaN
4,3146120,1/1/15,0:33,NaN,NaN,NaN,NaN,NaN,RICHMOND TERRACE,SOUTH AVENUE,...,UNKNOWN,PASSENGER VEHICLE,NaN,NaN,NaN,UNSPECIFIED,UNSPECIFIED,NaN,NaN,NaN

In [9]:
df.BOROUGH.unique()

array(['QUEENS', nan, 'BROOKLYN', 'MANHATTAN', 'BRONX', 'STATEN ISLAND'], dtype=object)

In [11]:
df2=df[["BOROUGH","VEHICLE 1 TYPE","VEHICLE 2 TYPE","VEHICLE 3 TYPE","VEHICLE 4 TYPE","VEHICLE 5 TYPE"]]

In [68]:
df2.head()

,BOROUGH,VEHICLE 1 TYPE,VEHICLE 2 TYPE,VEHICLE 3 TYPE,VEHICLE 4 TYPE,VEHICLE 5 TYPE
0,QUEENS,SPORT UTILITY/STATION WAGON,NaN,NaN,NaN,NaN
1,NaN,PASSENGER VEHICLE,NaN,NaN,NaN,NaN
2,BROOKLYN,PASSENGER VEHICLE,UNKNOWN,NaN,NaN,NaN
3,BROOKLYN,BUS,PASSENGER VEHICLE,NaN,NaN,NaN
4,NaN,UNKNOWN,PASSENGER VEHICLE,NaN,NaN,NaN

In [69]:
df3=df2[df2["VEHICLE 4 TYPE"].isnull() & (df2["BOROUGH"]=="QUEENS")&df2["VEHICLE 3 TYPE"].notnull()]

In [59]:
df3.head()

,BOROUGH,VEHICLE 1 TYPE,VEHICLE 2 TYPE,VEHICLE 3 TYPE,VEHICLE 4 TYPE,VEHICLE 5 TYPE
6,QUEENS,PASSENGER VEHICLE,PASSENGER VEHICLE,SPORT UTILITY/STATION WAGON,NaN,NaN
60,QUEENS,PASSENGER VEHICLE,PASSENGER VEHICLE,PASSENGER VEHICLE,NaN,NaN
103,QUEENS,SPORT UTILITY/STATION WAGON,SPORT UTILITY/STATION WAGON,SPORT UTILITY/STATION WAGON,NaN,NaN
190,QUEENS,SPORT UTILITY/STATION WAGON,PASSENGER VEHICLE,PASSENGER VEHICLE,NaN,NaN
191,QUEENS,UNKNOWN,SPORT UTILITY/STATION WAGON,SPORT UTILITY/STATION WAGON,NaN,NaN

In [66]:
df3=df2[df2["VEHICLE 4 TYPE"].notnull() & (df2["BOROUGH"]=="QUEENS")]

In [32]:
# DataFrame(data, columns=['year', 'state', 'pop'])

In [70]:
len(df3)

4498

In [113]:
def Cal(B):
    t1=df2[df2["VEHICLE 2 TYPE"].isnull() & (df2["BOROUGH"]==B)&df2["VEHICLE 1 TYPE"].notnull()]
    t2=df2[df2["VEHICLE 3 TYPE"].isnull() & (df2["BOROUGH"]==B)&df2["VEHICLE 2 TYPE"].notnull()]
    t3=df2[df2["VEHICLE 4 TYPE"].isnull() & (df2["BOROUGH"]==B)&df2["VEHICLE 3 TYPE"].notnull()]
    t4=df2[df2["VEHICLE 4 TYPE"].notnull() & (df2["BOROUGH"]==B)]
    data={"BOROUGH":[B],"ONE V":[len(t1)],"TWO V":[len(t2)],"THREE V":[len(t3)],"MORE V":[len(t4)]}
    return DataFrame(data,columns=["BOROUGH","ONE V","TWO V","THREE V","MORE V"])

In [114]:

blist=['QUEENS','BROOKLYN','MANHATTAN','BRONX','STATEN ISLAND']

In [115]:
t1=df2[df2["VEHICLE 2 TYPE"].isnull() & (df2["BOROUGH"].isnull())&df2["VEHICLE 1 TYPE"].notnull()]
t2=df2[df2["VEHICLE 3 TYPE"].isnull() & (df2["BOROUGH"].isnull())&df2["VEHICLE 2 TYPE"].notnull()]
t3=df2[df2["VEHICLE 4 TYPE"].isnull() & (df2["BOROUGH"].isnull())&df2["VEHICLE 3 TYPE"].notnull()]
t4=df2[df2["VEHICLE 4 TYPE"].notnull() & (df2["BOROUGH"].isnull())]
data={"BOROUGH":["Nah"],"ONE V":[len(t1)],"TWO V":[len(t2)],"THREE V":[len(t3)],"MORE V":[len(t4)]}
df5=DataFrame(data,columns=["BOROUGH","ONE V","TWO V","THREE V","MORE V"])

In [116]:
frame=[Cal("QUEENS"),Cal("BROOKLYN"),Cal("MANHATTAN"),Cal("BRONX"),Cal("STATEN ISLAND"),df5]

In [118]:
pd.concat(frame)

         BOROUGH  ONE V   TWO V  THREE V  MORE V
0         QUEENS  12962   70260     4498    1420
0       BROOKLYN  17375   80207     4980    1612
0      MANHATTAN  13318   66958     2024     501
0          BRONX   8627   34385     1962     625
0  STATEN ISLAND   2343   10676      759     165
0            Nah  22357  104045     9210    2508